{
  "skills": [
    {
      "name": "Programing languages",
      "items": [
        {
          "name": "Java",
          "score": 9,
          "info": "The one I most often work with. I like it for its consistency and stability."
        },
        {
          "name": "Kotlin",
          "score": 9,
          "info": "My language of choice for backedn"
        },
        {
          "name": "TypeScript",
          "score": 6,
          "info": "Good way to make ES more friendly to programmers"
        },
        {
          "name": "JavaScript",
          "score": 8,
          "info": "I like to work with it as it is very flexible, sometimes wired and funny."
        },
        {
          "name": "Groovy",
          "score": 6,
          "info": "Although I used it mainly in spock tests (and some gradle configs) I really like the power it gives over the typical java."
        },
        {
          "name": "Python",
          "score": 4,
          "info": "I've most often use it to script something or write an extension."
        },
        {
          "name": "PHP",
          "score": 6,
          "info": "Sometimes the easiest and fastest to use, even I don't like its inconsistency and style."
        },
        {
          "name": "SQL",
          "score": 8,
          "info": "Powerful and useful - I used it for many years already."
        }
      ]
    },
    {
      "name": "Backend Development",
      "items": [
        {
          "name": "Spring",
          "score": 8,
          "info": "I started using it 15 years ago and I'm happy it evolves all the time. Heavily used the security module."
        },
        {
          "name": "Jdbi",
          "score": 8,
          "info": "Another standard which is well defined and simple. Almost alwayse used it with Hibernate, just once with google BigData"
        },
        {
          "name": "JPA",
          "score": 8,
          "info": "Another standard which is well defined and simple. Almost alwayse used it with Hibernate, just once with google BigData"
        },
        {
          "name": "Hibernate",
          "score": 7,
          "info": "I've spent many years with it and I could for example configure level 2 cache or add interceptors to monitor entity changes"
        },
        {
          "name": "MySql",
          "score": 6,
          "info": "I used it in many projects already but I don't feel like a dba for it"
        },
        {
          "name": "JMS",
          "score": 6
        },
        {
          "name": "RabbitMq",
          "score": 6
        },
        {
          "name": "pact.io",
          "score": 8,
          "info": "Not only backend related but I think fits here best"
        },
        {
          "name": "Docker",
          "score": 8
        },
        {
          "name": "k8s",
          "score": 4
        },
        {
          "name": "AWS",
          "score": 2
        },
        {
          "name": "GCP",
          "score": 2
        },
        {
          "name": "MongoDb",
          "score": 5,
          "info": "I've used it in my hobby project (including MapReduce functionality) and one commercial but never used it in real production, so I'm not aware of it's weakness. But I still really liked it."
        }
      ]
    },
    {
      "name": "Frontend Development",
      "items": [
        {
          "name": "React",
          "score": 7,
          "info": "I really like the idea of creating own 'tags' and the way the library works"
        },
        {
          "name": "Next.js",
          "score": 6,
          "info": "Used to create this CV"
        },
        {
          "name": "Redux",
          "score": 8,
          "info": "Simple and powerful, although I still don't like the switch and constants for actions"
        },
        {
          "name": "Html",
          "score": 8,
          "info": "Understanding the DOM structure and what DOM is, used HTML for about 15 years now"
        },
        {
          "name": "CSS",
          "score": 6,
          "info": "I know how to use it ¯\\_(ツ)_/¯"
        },
        {
          "name": "Tailwindcss",
          "score": 5,
          "info": "I'm not sure yet I like this approach, very comfortable on one hand on other I can see potential problems with it"
        },
        {
          "name": "Sass",
          "score": 6,
          "info": "An eye opener for CSS issues, very simple and very useful same time."
        },
        {
          "name": "Jest",
          "score": 6
        }
      ]
    },
    {
      "name": "Mobile Development",
      "items": [
        {
          "name": "ReactNative",
          "score": 2,
          "info": "I've used it many years ago and it would be my choice for any next mobile application"
        },
        {
          "name": "Dagger",
          "score": 6,
          "info": "Small and sharp, I also use it in small java web apps - for which Spring IOC is to heavy"
        },
        {
          "name": "Butterknife",
          "score": 6,
          "info": "Pretty useful and helps removes a lot of boilerplate code"
        },
        {
          "name": "Firebase",
          "score": 3,
          "info": "Only started with services it provides. I researched OCR, messaging and configuration modules"
        },
        {
          "name": "GreenDAO",
          "score": 5,
          "info": "I've chosen it over ORMLite solution, it's faster and simpler to use"
        },
        {
          "name": "Retrofit",
          "score": 4,
          "info": "Natural choice for android rest client, I've not write to many client methods yet"
        },
        {
          "name": "EventBus",
          "score": 3,
          "info": "It eased events sending and threads handling a lot"
        }
      ]
    },
    {
      "name": "Soft Skills",
      "items": [
        {
          "name": "analytical mind",
          "info": "Always want to understand whole systems and how they work technically and in real live, often helping BA with fixing analysis gaps. Really like to find sources of difficult bugs."
        },
        {
          "name": "creative",
          "info": "I like to suggest solutions and I like to create (both software and 'real' things)"
        },
        {
          "name": "fast learner",
          "info": "I really like to learn and doing it almost all the time in my free time"
        },
        {
          "name": "mentor",
          "info": "Always happy to introduce new people to the project, team or technology"
        },
        {
          "name": "relish a challenge",
          "info": "Bigger challenge, bigger fun!"
        },
        {
          "name": "good sense of humour",
          "smiles": 5,
          "info": "It's much better to work in happy place with happy people!"
        }
      ]
    }
  ],
  "languages": [
    {
      "name": "English",
      "level": "Very good",
      "score": 8
    },
    {
      "name": "Polish",
      "level": "Native",
      "score": 10
    }
  ],
  "interests": [ "Programming", "DIY", "garden works", "electronics" ]
}
